Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
	/*---------------------------------------------------------------------------*/

	/*Data class interface descriptor*/
	0x09,   /* bLength: Endpoint Descriptor size */
	0x04,  /* bDescriptorType: */
	0x01,   /* bInterfaceNumber: Number of Interface */
	0x00,   /* bAlternateSetting: Alternate setting */
	0x02,   /* bNumEndpoints: Two endpoints used */
	0x0A,   /* bInterfaceClass: CDC */
	0x00,   /* bInterfaceSubClass: */
	0x00,   /* bInterfaceProtocol: */
	0x00,   /* iInterface: */

	/*Endpoint OUT Descriptor*/
	0x07,   						  /* bLength: Endpoint Descriptor size */
	0x05,     						  /* bDescriptorType: Endpoint */
	0x01,                      		  /* bEndpointAddress */
	0x02,                       	  /* bmAttributes: Bulk */
	LOBYTE(USB_CDC_MAX_PACKET_SIZE),  /* wMaxPacketSize: evaluates to 0x00 for 512 */
	HIBYTE(USB_CDC_MAX_PACKET_SIZE),  /* wMaxPacketSize: evaluates to 0x02 for 512 */
	0x00,                             /* bInterval: ignore for Bulk transfer */

	/*Endpoint IN Descriptor*/
	0x07,   						  /* bLength: Endpoint Descriptor size */
	0x05,     						  /* bDescriptorType: Endpoint */
	0x81,                     		  /* bEndpointAddress (EP1) */
	0x02,                             /* bmAttributes: Bulk */
	LOBYTE(USB_CDC_MAX_PACKET_SIZE),  /* wMaxPacketSize: evaluates to 0x00 for 512 */
	HIBYTE(USB_CDC_MAX_PACKET_SIZE),  /* wMaxPacketSize: evaluates to 0x02 for 512 */
	0x00                              /* bInterval: ignore for Bulk transfer */
};		// EP0 uses address 0x00 (OUT) and 0x80 (IN) implicitly and doesn't need an EP Descriptor (as Default Control Pipe required by the USB spec)
		// Its properties are defined directly in the Device Descriptor

/* Required: tells the host OS how the device would behave if it were plugged into a port running at its other supported speed */
const uint8_t deviceQualifierDescriptor [DEVICE_QUALIFIER_LENGTH] __attribute__((aligned(4))) = {
	DEVICE_QUALIFIER_LENGTH, /* 0x0A (10 bytes) */
	0x06,                    /* bDescriptorType: DEVICE_QUALIFIER (0x06) */
	0x00,                    /* bcdUSB LSB: 0x00 */
	0x02,                    /* bcdUSB MSB: 0x02 -> USB 2.0 specification (0x0200) */
	0x00,                    /* bDeviceClass: Specified at the Interface level */
	0x00,                    /* bDeviceSubClass: 0 */
	0x00,                    /* bDeviceProtocol: 0 */
	0x40,                    /* bMaxPacketSize0: 64 bytes (0x40) for EP0 at the other speed */
	0x01,                    /* bNumConfigurations: 1 valid configuration */
	0x00                     /* bReserved: Must be 0x00 */
};

/* Other Speed Configuration Descriptor (Same as Configuration Descriptor, but type 0x07)
   And Bulk EP wMaxPacketSize set to 64 bytes for Full-Speed mode */
const uint8_t otherSpeedConfigurationDescriptor [OTHER_SPEED_CONFIGURATION_DESCRIPTOR_LENGTH] __attribute__((aligned(4))) = {
    0x09,                               /* bLength */
    0x07,                               /* bDescriptorType: OTHER_SPEED_CONFIGURATION */
	OTHER_SPEED_CONFIGURATION_DESCRIPTOR_LENGTH, 0x00, /* wTotalLength */
    0x02,                               /* bNumInterfaces */
    0x01,                               /* bConfigurationValue */
    0x00,                               /* iConfiguration */
    0xC0,                               /* bmAttributes: Self-powered */
    0x32,                               /* MaxPower: 100 mA */
    /* Interface 0 (CDC Control) */
    0x09, 0x04, 0x00, 0x00, 0x01, 0x02, 0x02, 0x01, 0x00,
    /* Header Functional Descriptor */
    0x05, 0x24, 0x00, 0x10, 0x01,
    /* Call Management Functional Descriptor */
    0x05, 0x24, 0x01, 0x00, 0x01,
    /* ACM Functional Descriptor */
    0x04, 0x24, 0x02, 0x02,
    /* Union Functional Descriptor */
    0x05, 0x24, 0x06, 0x00, 0x01,
    /* CDC notification endpoint (required by CDC ACM; not used by the application). */
//    0x07, 0x05, (0x80U | USB_CDC_NOTIFICATION_EP), 0x03,
//    LOBYTE(USB_CDC_NOTIFICATION_MPS), HIBYTE(USB_CDC_NOTIFICATION_MPS),
//    USB_CDC_NOTIFICATION_INTERVAL,
    /* Interface 1 (CDC Data) */
    0x09, 0x04, 0x01, 0x00, 0x02, 0x0A, 0x00, 0x00, 0x00,
    /* Endpoint OUT Descriptor (FS Bulk: Max Packet Size = 64 bytes) */
    0x07, 0x05, 0x01, 0x02,
    LOBYTE(64), HIBYTE(64),
    0x00,
    /* Endpoint IN Descriptor (FS Bulk: Max Packet Size = 64 bytes) */
    0x07, 0x05, 0x81, 0x02,
    LOBYTE(64), HIBYTE(64),
    0x00
};

/* Language string descriptor */
const uint8_t languageStringDescriptor [LANG_DESCRIPTOR_LENGTH] __attribute__((aligned(4))) = {
	LANG_DESCRIPTOR_LENGTH,				 /* USB_LEN_LANGID_STR_DESC */
	0x03,    			/* USB_DESC_TYPE_STRING */
	LOBYTE(USBD_LANGID_STRING),
	HIBYTE(USBD_LANGID_STRING)
};

/* Vendor string descriptor */
const uint8_t manufactorStringDescriptor [MFC_DESCRIPTOR_LENGTH] __attribute__((aligned(4))) = {
	MFC_DESCRIPTOR_LENGTH,
	0x03,	/* USB_DESC_TYPE_STRING */
	'S', 0x00,
	'T', 0x00,
	'M', 0x00,
	'i', 0x00,
	'c', 0x00,
	'r', 0x00,
	'o', 0x00,
	'e', 0x00,
	'l', 0x00,
	'e', 0x00,
	'c', 0x00,
	't', 0x00,
	'r', 0x00,
	'o', 0x00,
	'n', 0x00,
	'i', 0x00,
	'c', 0x00,
	's', 0x00
};

/* Product string descriptor */
const uint8_t productStringDescriptor [PRODUCT_DESCRIPTOR_LENGTH]  __attribute__((aligned(4))) = {
	PRODUCT_DESCRIPTOR_LENGTH,
	0x03,	/* USB_DESC_TYPE_STRING */
	'S', 0x00,
	'T', 0x00,
	'M', 0x00,
	'3', 0x00,
	'2', 0x00,
	' ', 0x00,
	'V', 0x00,
	'i', 0x00,
	'r', 0x00,
	't', 0x00,
	'u', 0x00,
	'a', 0x00,
	'l', 0x00,
	' ', 0x00,
	'C', 0x00,
	'o', 0x00,
	'm', 0x00,
	'P', 0x00,
	'o', 0x00,
	'r', 0x00,
	't', 0x00
};

/*
 * Serial number string descriptor.
 * This buffer is intentionally mutable so a generic application can provide
 * its own stable product/manufacturing serial number when required. If the
 * application does not call USB_CDC_SetSerialNumber(), the driver populates
 * it from the STM32 96-bit UID during USB initialization.
 */
uint8_t serialNumberStringDescriptor[SERIAL_DESCRIPTOR_LENGTH] __attribute__((aligned(4)));
static uint8_t serialNumberIsUserDefined = 0U;

const uint8_t stringInterface [INTERFACE_STRING_LENGTH] __attribute__((aligned(4))) = {
	INTERFACE_STRING_LENGTH,
	0x03,	/* USB_DESC_TYPE_STRING */
	'C', 0x00,
	'D', 0x00,
	'C', 0x00,
	' ', 0x00,
	'I', 0x00,
	'n', 0x00,
	't', 0x00,
	'e', 0x00,
	'r', 0x00,
	'f', 0x00,
	'a', 0x00,
	'c', 0x00,
	'e', 0x00
};

