Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
const uint8_t configurationStringDescriptor [CONFIG_STRING_LENGTH] __attribute__((aligned(4))) = {
	CONFIG_STRING_LENGTH,
	0x03,	/* USB_DESC_TYPE_STRING */
	'C', 0x00,
	'D', 0x00,
	'C', 0x00,
	' ', 0x00,
	'C', 0x00,
	'o', 0x00,
	'n', 0x00,
	'f', 0x00,
	'i', 0x00,
	'g', 0x00
};


/****************************************************************************/

static uint32_t device_state = DEVICE_STATE_DEFAULT; /* Device state */

EndPointStruct EndPoint[EP_COUNT];	/* All the Enpoints are included in this array */

static USB_setup_req_data setup_pkt_data; /* Setup Packet var */

/****************************************************************
 * 		static functions' declarations
*****************************************************************/

/* Device state */
static inline void set_device_status(eDeviceState state);

/* Init EP */
static void initEndPoints(void);

/* EP routine */
static inline uint32_t is_tx_ep_ready(uint8_t EPnum);

static void Get_ID_To_String(uint8_t *dest); // Build default serial number from STM32 UID
static uint8_t USB_CDC_prepare_EP1_OUT_DMA(void);

static circBufferAddress peek_circBufferRx(uint16_t len);
static void commit_circBufferRx(uint16_t len);

/**********************************************************************
 * GetSysTick() is required for Timeout detection in several functions
 * you can add msTicks++ in your SysTick_Handler if you use it already
 * or you can provide your own Timeout function (eg with a timer)
 **********************************************************************/

/* Weak implementation so the user can override it in main.c or application code */
__WEAK uint32_t GetSysTick(void) {
    extern volatile uint32_t msTicks; // Or return HAL_GetTick() / custom timer tick
    return msTicks;
}


/****************************************************
* 		Circular buffer*
***************************************************/

__attribute__((aligned(4))) static uint8_t circBufferTx[CIRC_BUFFER_TX_SIZE];
static volatile uint16_t writePtrTxCbuf = 0U;
static volatile uint16_t readPtrTxCbuf = 0U;
volatile uint16_t rxWrapLimit = CIRC_BUFFER_RX_SIZE; // Dynamic wrap boundary for zero-copy DMA padding

/*
 * EP1 IN DMA staging buffer.
 *
 * Always 4-byte aligned and maximum one HS bulk packet.
 * We copy from circBufferTx here before starting USB DMA.
 */
__attribute__((aligned(4))) static uint8_t ep1TxDmaBuffer[MAX_CDC_EP1_TX_SIZ];

/*
 * Information about the transfer currently owned by USB DMA.
 * The circular-buffer read pointer is advanced only after XFRC.
 */
static volatile uint16_t ep1TxPendingLen = 0U;

__attribute__((aligned(4))) uint8_t circBufferRx[CIRC_BUFFER_RX_SIZE];
static volatile uint16_t writePtrRxCbuf = 0U;  // make is static again if ISR functions included in this page
static volatile uint16_t readPtrRxCbuf = 0U; // make is static again if ISR functions included in this page

/*
 * EP1 OUT DMA staging buffer.
 *
 * USB DMA always writes to this aligned buffer. The received data is copied
 * to circBufferRx only after the USB transfer has completed. This avoids
 * unaligned DMA addresses and circular-buffer wrap-around crossing the end
 * of the array.
 */
__attribute__((aligned(4))) static uint8_t ep1RxDmaBuffer[RX_BUFFER_EP1_SIZE]; // staging buffer
static volatile uint16_t ep1RxPendingIndex = 0U;


static inline uint32_t is_circBufferTx_empty(){
	return (readPtrTxCbuf == writePtrTxCbuf);
}

static inline uint32_t get_circBufferTx_freeSize(){
	/* Snapshot pointers to avoid interrupt race conditions - the pointers aren't modified, so no need to __disable_irq() here */
	uint16_t w = writePtrTxCbuf; // copying the values of volatile global variables into local variables at the beginning of a function.
	uint16_t r = readPtrTxCbuf; // creates a "frozen" version of the state that won't change while your math is running, even if an interrupt fires in the middle of your calculation.

	// We return SIZE - 1 to ensure we always leave one gap (the "N-1" Rule for full buffer)
	if (w == r) return CIRC_BUFFER_TX_SIZE - 1; // Empty
	if (w > r) {
		// Data is contiguous: free space is the two ends
		return CIRC_BUFFER_TX_SIZE - (w - r) - 1 ;
	} else {
		// Data is wrapped: free space is the gap in the middle
		return (r - w) - 1;
	}
}

static inline uint32_t get_circBufferRx_freeSize(){
	/* Snapshot pointers to avoid interrupt race conditions - the pointers aren't modified, so no need to __disable_irq() here */
	uint16_t w = writePtrRxCbuf; // copying the values of volatile global variables into local variables at the beginning of a function  creates a "frozen"
	uint16_t r = readPtrRxCbuf; // version of the state that won't change while your math is running, even if an interrupt fires in the middle of your calculation.
	uint16_t limit = rxWrapLimit; // Snapshot the dynamic limit

	// We return SIZE - 1 to ensure we always leave one gap (the "N-1" Rule for full buffer)
	if (w == r) return CIRC_BUFFER_RX_SIZE - 1; // Empty
	if (w > r) {
		// Data is contiguous: free space is the two ends
		return limit - (w - r) - 1;
	} else {
		// Data is wrapped: free space is the gap in the middle
		return (r - w) - 1;
	}
}


void write_to_circBufferTx(uint8_t *buf, uint16_t len){

	if (len == 0) return;

	// Check if we need to wrap around
	if((writePtrTxCbuf + len) >= CIRC_BUFFER_TX_SIZE){
		uint32_t write_tail = (uint32_t)((CIRC_BUFFER_TX_SIZE) - writePtrTxCbuf); // Calculate how much fits at the end of the array
		memcpy(&circBufferTx[writePtrTxCbuf], buf, write_tail); // Copy the tail part

		uint32_t remaining = (uint32_t)(len - write_tail); // Copy the remaining part to the beginning of the array
		if (remaining > 0) {
			memcpy(&circBufferTx[0], (buf + write_tail), remaining);
		}
		writePtrTxCbuf = (uint16_t)remaining; // Update pointer with modulo or manual wrap
	}
	else{
		memcpy(&circBufferTx[writePtrTxCbuf], buf, len); // Simple contiguous copy
		writePtrTxCbuf = (uint16_t)(writePtrTxCbuf + len); // Update pointer
	}
	// Safety check: if the pointer exactly hits the end of the array, wrap it to 0
	if (writePtrTxCbuf == CIRC_BUFFER_TX_SIZE) writePtrTxCbuf = 0;
}


/**
* brief  Return  current index and length of datas from the circular buffer
* param  Maximum length to get. For Example, if len=256, the function returns 256 length string index, if used space > 256.
* param  If used space < x, the function returns used space.
* retval First character's index and length
*/
static circBufferAddress peek_circBufferTx(uint16_t len) {

	circBufferAddress result = {0, 0};

	uint16_t w = writePtrTxCbuf; // Snapshot
	uint16_t r = readPtrTxCbuf;

