Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
	// 1. Check if truly empty
	if (w == r) return result;

	// 2. Calculate EXACT data count (Direct Math)
	uint16_t writtenSize;
	if (w > r) 	writtenSize = w - r;
	else writtenSize = (CIRC_BUFFER_TX_SIZE - r) + w;

	if (len > writtenSize) len = writtenSize;  // Constrain requested len to available data

	result.index = r;

	// 4. Wrap-around logic (note: Use '>' not '>=' because index starts at 0)
	// If r + len == SIZE, the last byte is at SIZE-1, which is perfectly valid.
	if ((r + len) > CIRC_BUFFER_TX_SIZE) {
		// Tell the USB driver to only send the bytes that actually exist at the end of the buffer.
		result.len = (uint16_t)(CIRC_BUFFER_TX_SIZE - r);
	} else {
		result.len = len; // The data fits perfectly within the remaining space of the array, it returns the full requested len
	}

	/*
	 * IMPORTANT: do not advance readPtrTxCbuf here.
	 * USB DMA owns the transfer until the EP1 XFRC interrupt.
	 */

	return result;
}

static void commit_circBufferTx(uint16_t len) {

	if (len == 0) return;

	uint16_t nextReadPtr = (uint16_t)(readPtrTxCbuf + len);
	if (nextReadPtr >= CIRC_BUFFER_TX_SIZE) nextReadPtr -= CIRC_BUFFER_TX_SIZE;

	readPtrTxCbuf = nextReadPtr;
}

circBufferAddress peek_circBufferRx(uint16_t requested_Len) {
/*	If the requested amount crosses the end of the array, peek_circBufferRx() returns only the bytes available before the boundary.
	Therefore, the application should consume the RX buffer inside a loop until no data remains*/

    circBufferAddress result = {0, 0};

    /* Snapshot the pointers. The RX write pointer may be advanced by the USB ISR,
     * but readPtrRxCbuf is owned by the application until commit_circBufferRx(). */
    uint16_t w = writePtrRxCbuf;
    uint16_t r = readPtrRxCbuf;
    uint16_t limit = rxWrapLimit; // Snapshot the dynamic limit

    /* Direct data count (N-1 compliant). */
    uint16_t actualData;
    if (w == r) {
        return result; // Truly empty
    }
    else if (w > r) {
        actualData = w - r;
    }
    else {
    	actualData = (limit - r) + w; // Use dynamic limit
    }

    /* Clamp requested length to the data currently available. */
    uint16_t len = (requested_Len > actualData) ? actualData : requested_Len;
    result.index = r;

    /* Return only a contiguous block. The application must call peek again after
     * commit_circBufferRx() to consume data on the other side of the wrap. */
    if ((r + len) > limit) { 						// Clamp to dynamic limit
        result.len = (uint16_t)(CIRC_BUFFER_RX_SIZE - r);
    }
    else {
        result.len = len;
    }

    /* IMPORTANT: do not advance readPtrRxCbuf here.
     * The application owns this data until it has finished copying/processing it. */
    return result;
}

void commit_circBufferRx(uint16_t len) {

    if (len == 0) return;

    /* The application has finished using the previously peeked data.
     * Only now may the consumed space become available to the USB RX DMA. */
    __disable_irq();

    uint16_t nextReadPtr = (uint16_t)(readPtrRxCbuf + len);

    if (nextReadPtr >= rxWrapLimit) {   // Check against the dynamic limit and restore upon wrapping
    	nextReadPtr = 0;
    	rxWrapLimit = CIRC_BUFFER_RX_SIZE; // Restore the limit for the next cycle
    }
    readPtrRxCbuf = nextReadPtr;

    /* Re-arm EP1 OUT only after the application has released the consumed data. */
    USB_CDC_prepare_EP1_OUT_DMA();

    __enable_irq();
}


/***************************************************
*
* 	Initialization functions
*
***************************************************/

void SystemClock_Config(void)
{
    /* Enable Power Control clock & set regulator voltage scaling */
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_VOS; // Scale 1 mode (up to 180 MHz)

    /* Enable HSE Bypass for active oscillator (SiT2001B) & Enable HSE */
    RCC->CR |= RCC_CR_HSEBYP; // Bypass internal oscillator circuit for external clock source
    RCC->CR |= RCC_CR_HSEON;
    while (!(RCC->CR & RCC_CR_HSERDY));

    /* Enable Over-Drive Mode (STM32F446 specific) */
    PWR->CR |= PWR_CR_ODEN;
    while (!(PWR->CSR & PWR_CSR_ODRDY));
    PWR->CR |= PWR_CR_ODSWEN;
    while (!(PWR->CSR & PWR_CSR_ODSWRDY));

    /* Configure Flash latency (5 Wait States for 180 MHz @ 3.3V) */
    FLASH->ACR = FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_5WS;

    /* Configure Main PLL for 180 MHz SYSCLK from 24 MHz HSE oscillator
     * VCO input  = HSE / PLLM = 24 MHz / 24 = 1 MHz
     * VCO output = 1 MHz * PLLN = 1 MHz * 360 = 360 MHz
     * SYSCLK     = VCO / PLLP = 360 MHz / 2 = 180 MHz
     */
    RCC->PLLCFGR = (24 << RCC_PLLCFGR_PLLM_Pos)
                 | (360 << RCC_PLLCFGR_PLLN_Pos)
                 | (0 << RCC_PLLCFGR_PLLP_Pos) // Div 2 (00 in PLLP bits)
                 | RCC_PLLCFGR_PLLSRC_HSE;

    RCC->CR |= RCC_CR_PLLON;
    while (!(RCC->CR & RCC_CR_PLLRDY));

    /* Configure AHB/APB prescalers (AHB=1, APB1=4, APB2=2) */
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2;

    /* Select PLL as System Clock Source */
    RCC->CFGR |= RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);
}

uint32_t USB_OTG_HS_GPIO_Init(void)
{
    /* 1. Enable Clocks for GPIOA, GPIOB, GPIOC, and OTG HS + ULPI */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN
                 |  RCC_AHB1ENR_GPIOBEN
                 |  RCC_AHB1ENR_GPIOCEN
                 |  RCC_AHB1ENR_OTGHSEN
                 |  RCC_AHB1ENR_OTGHSULPIEN;

    /* 2. Release USB3300 Hardware Reset (PA6) after a small delay (50ms)
     * Set PA6 as Output-Low to release PHY reset and enable 60 MHz CLKOUT.   */

    GPIOA->MODER   &= ~(0x3 << (6 * 2));
    GPIOA->MODER   |=  (0x1 << (6 * 2));  // General purpose output
    GPIOA->OTYPER  &= ~(1 << 6);          // Push-pull
    GPIOA->OSPEEDR |=  (0x3 << (6 * 2));  // Very High Speed
    GPIOA->BSRR     =  (1 << 6);   // Drive High (Reset)
    for (volatile uint32_t i = 0; i < 600000; i++) { __NOP(); }

    /* 3. Configure ULPI GPIO Pins to AF10 (Very High Speed)
     * PA3 (D0), PA5 (CK)
     * PB0 (D1), PB1 (D2), PB2 (D4), PB5 (D7), PB10 (D3), PB12 (D5), PB13 (D6)
     * PC0 (STP), PC2 (DIR), PC3 (NXT)
     */
    // Set MODER to Alternate Function (0b10)
    GPIOA->MODER &= ~((0x3 << (3 * 2)) | (0x3 << (5 * 2)));
    GPIOA->MODER |=  ((0x2 << (3 * 2)) | (0x2 << (5 * 2)));

    GPIOB->MODER &= ~((0x3 << (0 * 2))  | (0x3 << (1 * 2))  | (0x3 << (2 * 2))  | (0x3 << (5 * 2)) |
                      (0x3 << (10 * 2)) | (0x3 << (12 * 2)) | (0x3 << (13 * 2)));
    GPIOB->MODER |=  ((0x2 << (0 * 2))  | (0x2 << (1 * 2))  | (0x2 << (2 * 2))  | (0x2 << (5 * 2)) |
                      (0x2 << (10 * 2)) | (0x2 << (12 * 2)) | (0x2 << (13 * 2)));

    GPIOC->MODER &= ~((0x3 << (0 * 2)) | (0x3 << (2 * 2)) | (0x3 << (3 * 2)));
    GPIOC->MODER |=  ((0x2 << (0 * 2)) | (0x2 << (2 * 2)) | (0x2 << (3 * 2)));

    // Set OSPEEDR to Very High Speed (0b11)
    GPIOA->OSPEEDR |= ((0x3 << (3 * 2)) | (0x3 << (5 * 2)));
    GPIOB->OSPEEDR |= ((0x3 << (0 * 2))  | (0x3 << (1 * 2))  | (0x3 << (2 * 2))  | (0x3 << (5 * 2)) |
                       (0x3 << (10 * 2)) | (0x3 << (12 * 2)) | (0x3 << (13 * 2)));
    GPIOC->OSPEEDR |= ((0x3 << (0 * 2))  | (0x3 << (2 * 2))  | (0x3 << (3 * 2)));

    // Map Alternate Function AF10 (0xA) for all ULPI pins
    GPIOA->AFR[0] &= ~((0xF << (3 * 4)) | (0xF << (5 * 4)));
    GPIOA->AFR[0] |=  ((0xA << (3 * 4)) | (0xA << (5 * 4)));

