Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
    // PB0, PB1, PB2, PB5 are in AFR[0]
    GPIOB->AFR[0] &= ~((0xF << (0 * 4)) | (0xF << (1 * 4)) | (0xF << (2 * 4)) | (0xF << (5 * 4)));
    GPIOB->AFR[0] |=  ((0xA << (0 * 4)) | (0xA << (1 * 4)) | (0xA << (2 * 4)) | (0xA << (5 * 4)));

    // PB10, PB12, PB13 are in AFR[1]
    GPIOB->AFR[1] &= ~((0xF << ((10 - 8) * 4)) | (0xF << ((12 - 8) * 4)) | (0xF << ((13 - 8) * 4)));
    GPIOB->AFR[1] |=  ((0xA << ((10 - 8) * 4)) | (0xA << ((12 - 8) * 4)) | (0xA << ((13 - 8) * 4)));

    GPIOC->AFR[0] &= ~((0xF << (0 * 4)) | (0xF << (2 * 4)) | (0xF << (3 * 4)));
    GPIOC->AFR[0] |=  ((0xA << (0 * 4)) | (0xA << (2 * 4)) | (0xA << (3 * 4)));

    GPIOA->BSRR     =  (1 << (6 + 16));   // Drive Low (crucial: release Reset AFTER configuring the ULPI)

    for (volatile int i = 0; i < 10000; i++);  // Brief delay for USB3300 clock (ULPI_CK) to stabilize

    return 0;
}


uint32_t USB_OTG_HS_Core_Init(void)
{
	// device_state = DEVICE_STATE_DEFAULT;

    /* 1. Wait for AHB master Idle state before reset */
    while (!(USB_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL));

    /* 2. Configure GUSBCFG for external ULPI High-Speed PHY */
    uint32_t gusbcfg = USB_OTG_HS->GUSBCFG;

    // Clear PHYSEL (0 = External ULPI PHY), ULPIFSLS (0 = 60MHz HS mode), and PHYLPCS
    gusbcfg &= ~(USB_OTG_GUSBCFG_PHYSEL |
                 USB_OTG_GUSBCFG_ULPIFSLS |
                 USB_OTG_GUSBCFG_PHYLPCS);

    /* Set ULPI turnaround time (TRDT = 9 for 60MHz High Speed ULPI) */
    gusbcfg &= ~USB_OTG_GUSBCFG_TRDT;
    gusbcfg |=  (9U << USB_OTG_GUSBCFG_TRDT_Pos);

    /* Force Device Mode */
    gusbcfg &= ~USB_OTG_GUSBCFG_FHMOD;
    gusbcfg |=  USB_OTG_GUSBCFG_FDMOD;

    USB_OTG_HS->GUSBCFG = gusbcfg;

    /* 3. Issue Core Soft Reset via direct assignment (avoid RMW on trigger register) */
    USB_OTG_HS->GRSTCTL = USB_OTG_GRSTCTL_CSRST;
    while (USB_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_CSRST);

    /* Wait 3 PHY clocks after soft reset */
    for (volatile uint32_t i = 0; i < 1000; i++);

    /* 4. Configure Device Mode in Device Configuration Register */
    USB_OTG_DeviceTypeDef *USB_OTG_HS_DEV = ((USB_OTG_DeviceTypeDef *)(USB_OTG_HS_PERIPH_BASE + USB_OTG_DEVICE_BASE));
    USB_OTG_HS_DEV->DCFG &= ~USB_OTG_DCFG_DSPD; // High Speed mode

    /* 5. Enable DMA mode in AHB Configuration Register */
    USB_OTG_HS->GAHBCFG |= USB_OTG_GAHBCFG_DMAEN;

    return 0;
}


void USB_OTG_HS_FIFO_and_Interrupts_Init(void)
{
	/* Populate the default UID serial unless the application supplied a custom
	 * serial number before USB initialization. */
	if (!serialNumberIsUserDefined)
		Get_ID_To_String(serialNumberStringDescriptor);

    /* 1. Configure FIFO Sizes (measured in 32-bit words) */

    // RX FIFO: Start @ 0, Depth = 512 words (2048 bytes)
    USB_OTG_HS->GRXFSIZ = 512;

    // EP0 TX FIFO: Start @ 512, Depth = 64 words (256 bytes)
    USB_OTG_HS->DIEPTXF0_HNPTXFSIZ = (64 << USB_OTG_TX0FD_Pos) | 512;

    // EP1 TX FIFO (CDC Bulk IN): Start @ 576 (512 + 64), Depth = 256 words (1024 bytes)
    USB_OTG_HS->DIEPTXF[0] = (256 << USB_OTG_DIEPTXF_INEPTXFD_Pos) | (512 + 64);

    // EP2 TX FIFO (CDC notification IN): Start @ 832, Depth = 16 words (64 bytes).
    // Total allocation = 512 + 64 + 256 + 16 = 848 words, below the 1024-word HS FIFO RAM.
    //USB_OTG_HS->DIEPTXF[1] = (16 << USB_OTG_DIEPTXF_INEPTXFD_Pos) | (512 + 64 + 256);

    /* 2. Clear pending interrupts */
    USB_OTG_HS->GINTSTS = 0xFFFFFFFF; // Global Interrupt Status Register

    /* 3. Unmask required core interrupts */
    /* USB_OTG_HS->GINTMSK = USB_OTG_GINTMSK_RXFLVLM  | // RX FIFO Non-Empty (FIFO Level Mask)
                          USB_OTG_GINTMSK_USBRST   | // USB Reset
                          USB_OTG_GINTMSK_ENUMDNM  | // Enumeration Done
                          USB_OTG_GINTMSK_IEPINT   | // IN Endpoint Interrupt
                          USB_OTG_GINTMSK_OEPINT   | // OUT Endpoint Interrupt
                          USB_OTG_GINTMSK_WUIM;      // Resume/Wakeup Interrupt */
    USB_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST   | // USB Reset
    					  USB_OTG_GINTMSK_ENUMDNEM | // Enumeration Done
                          USB_OTG_GINTMSK_IEPINT   | // IN Endpoint Interrupt
                          USB_OTG_GINTMSK_OEPINT   | // OUT Endpoint Interrupt
                          USB_OTG_GINTMSK_WUIM;      // Resume/Wakeup Interrupt

    /* 4. Enable Global Interrupts in OTG Core */
    USB_OTG_HS->GAHBCFG |= USB_OTG_GAHBCFG_GINT;

    /* 5. Enable OTG_HS IRQ in NVIC */
    NVIC_SetPriority(OTG_HS_IRQn, 5);
    NVIC_EnableIRQ(OTG_HS_IRQn);
}

void USB_OTG_HS_Connect(void)
{
    USB_OTG_DeviceTypeDef *USB_OTG_HS_DEV = ((USB_OTG_DeviceTypeDef *)(USB_OTG_HS_PERIPH_BASE + USB_OTG_DEVICE_BASE));

    // Clear Soft Disconnect bit to pull D+ high via ULPI PHY (connect device to the bus)
    USB_OTG_HS_DEV->DCTL &= ~USB_OTG_DCTL_SDIS; // // Host will now detect the device
}

void USB_OTG_HS_Disconnect(void)
{
    USB_OTG_DeviceTypeDef *USB_OTG_HS_DEV = ((USB_OTG_DeviceTypeDef *)(USB_OTG_HS_PERIPH_BASE + USB_OTG_DEVICE_BASE));

    // Set Soft Disconnect bit to pull D+ low/tri-state via ULPI PHY (disconnect device from the bus)
    USB_OTG_HS_DEV->DCTL |= USB_OTG_DCTL_SDIS; // Host will detect the device disconnection
}

/**
* brief  fill endpoint structures with initial data
* param
* param
* retval
*/

static uint8_t USB_CDC_prepare_EP1_OUT_DMA(void)
{
	uint16_t w = writePtrRxCbuf;
	uint16_t r = readPtrRxCbuf;

	/*
	 * If EP1 OUT DMA is already active, don't touch the hardware
	 * configuration. This function can safely be called both from the
	 * USB ISR and after the application consumes RX data.
	 */
	if (USB_EP_OUT(1)->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
		return 1;

	/* Keep one byte unused in the circular buffer (N-1 rule).
	 * DMA receives into a dedicated, aligned 512-byte staging buffer.
	 */
	if (get_circBufferRx_freeSize() < RX_BUFFER_EP1_SIZE)
		return 0;

	if (w >= r) {
		if ((CIRC_BUFFER_RX_SIZE - w) < RX_BUFFER_EP1_SIZE) {
			/* Not enough contiguous space until the end; wrap to the beginning. */
			if (r > RX_BUFFER_EP1_SIZE) {
				// Because of the N-1 rule, if r = 512 and w = 0, the calculated free space is actually 511 bytes. A full 512B DMA packet (RX_BUFFER_EP1_SIZE)
				// requires at least 512B free, meaning r needs to be strictly greater than 512 for the wrap to be safe without breaking the safety margin.
				rxWrapLimit = w; // Lock in the exact boundary where valid data ends *
				w = 0;
				writePtrRxCbuf = 0;
			} else {
				return 0;
			}
		}
	} else {
		/* Free space is contiguous between w and r. */
		if ((r - w) <= RX_BUFFER_EP1_SIZE)
			return 0;
	}

