Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
	/* Remember where the completed DMA packet will be committed. */
	ep1RxPendingIndex = w;

	USB_EP_OUT(1)->DOEPTSIZ =
		(1U << USB_OTG_DOEPTSIZ_PKTCNT_Pos) | RX_BUFFER_EP1_SIZE;

	/* USB DMA always uses the aligned staging buffer. */
	USB_EP_OUT(1)->DOEPDMA = (uint32_t)ep1RxDmaBuffer;

	USB_EP_OUT(1)->DOEPCTL |=
		(USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

	return 1;
}

static void initEndPoints(){
	for (uint32_t i = 0; i < EP_COUNT; i++) {
		/* Global defaults for all Endpoints */
		EndPoint[i].statusRx  = EP_READY;
		EndPoint[i].statusTx  = EP_READY;
		EndPoint[i].rxCounter = 0;
		EndPoint[i].txCounter = 0; // Decrements the remaining bytes to track the transfer progress
		EndPoint[i].setTxBuffer  = &USB_CDC_setTxBuffer;
		EndPoint[i].txCallBack   = &USB_CDC_transferTXCallback;
	}

	/* --- EP0: Control (Shared) --- */
	EndPoint[0].rxBuffer_ptr = rxBufferEp0;
	EndPoint[0].rxCallBack   = &USB_CDC_transferRXCallback_EP0; // Handles Setup packets

	/* --- EP1: CDC Data (Bulk IN/OUT) --- */
	EndPoint[1].rxCallBack   = &USB_CDC_transferRXCallback_EP1;

	/* --- Hardware: Setup EP0 OUT for DMA Reception --- */
	uint32_t ep0_pktcnt = (RX_BUFFER_EP0_SIZE + MAX_CDC_EP0_TX_SIZ - 1) / MAX_CDC_EP0_TX_SIZ;
	USB_EP_OUT(0)->DOEPTSIZ = (ep0_pktcnt << 19)
										| RX_BUFFER_EP0_SIZE
										| USB_OTG_DOEPTSIZ_STUPCNT; // Keeps Setup packet counting capability

	// Point EP0 DMA directly to rxBufferEp0
	USB_EP_OUT(0)->DOEPDMA  = (uint32_t)(rxBufferEp0);

	// Clear NAK and enable EP0 OUT with DMA active
	USB_EP_OUT(0)->DOEPCTL  |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

	/* --- Hardware: Setup EP1 OUT (Bulk) for DMA Reception --- */
	USB_CDC_prepare_EP1_OUT_DMA();

	/* --- Hardware: EP2 IN CDC notification endpoint --- */
//	USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
//		USB_OTG_DIEPCTL_TXFNUM_1 | /* TX FIFO number 2 */
//		USB_OTG_DIEPCTL_EPTYP_0 | /* Interrupt endpoint */
//		USB_OTG_DIEPCTL_USBAEP |
//		USB_CDC_NOTIFICATION_MPS;
	/* EP2 remains NAKed until a Serial-State notification is implemented. */

	USB_OTG_HS->GINTSTS = 0xFFFFFFFF; 			 	// Reset Global Interrupt status (core interrupt register OTG_GINTSTS)
	USB_OTG_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;     // Clearing the bit (~) releases the soft disconnect, effectively "plugging" the device back in virtually
}



/***************************************************
*
* 	Miscellaneous service functions
*
***************************************************/

static void Get_ID_To_String(uint8_t *dest) {
	/* Default serial source: STM32 96-bit UID represented as 24 hex characters. */
	uint8_t *uid = (uint8_t *)0x1FFF7A10; // STM32F446 96-bit UID address
	const char hex_table[] = "0123456789ABCDEF";

	dest[0] = SERIAL_DESCRIPTOR_LENGTH;
	dest[1] = 0x03; // USB_DESC_TYPE_STRING

	for (uint8_t i = 0U; i < 12U; i++) {
		uint8_t byte = uid[i];
		dest[2U + (uint16_t)i * 4U] = hex_table[byte >> 4];
		dest[3U + (uint16_t)i * 4U] = 0x00;
		dest[4U + (uint16_t)i * 4U] = hex_table[byte & 0x0FU];
		dest[5U + (uint16_t)i * 4U] = 0x00;
	}
}

uint32_t USB_CDC_SetSerialNumber(const char *serial) {
	/* Maximum 24 ASCII characters fit in the 50-byte UTF-16LE descriptor. */
	uint32_t len = 0U;

	if (serial == NULL)
		return 0U;

	while (serial[len] != '\0') {
		if (len >= SERIAL_NUMBER_MAX_CHARS)
			return 0U;
		len++;
	}

	if (len == 0U)
		return 0U;

	serialNumberStringDescriptor[0] = (uint8_t)(2U + len * 2U);
	serialNumberStringDescriptor[1] = 0x03; // USB_DESC_TYPE_STRING

	for (uint32_t i = 0U; i < len; i++) {
		serialNumberStringDescriptor[2U + i * 2U] = (uint8_t)serial[i];
		serialNumberStringDescriptor[3U + i * 2U] = 0x00;
	}

	for (uint32_t i = 2U + len * 2U; i < SERIAL_DESCRIPTOR_LENGTH; i++)
		serialNumberStringDescriptor[i] = 0x00;

	serialNumberIsUserDefined = 1U;
	return EP_OK;
}

void USB_CDC_ForceResetState(void) {
	/*	A "Force Reset" means manually clearing the hardware's status registers, flushing the FIFO buffers,
		and re-enabling the "listening" state for the next incoming packet. */

    // 1. Atomic lock, protect against the USB Interrupt firing while we are resetting its world.
    __disable_irq();

    // 2. Software state reset
    readPtrRxCbuf = 0;
    writePtrRxCbuf = 0;
    readPtrTxCbuf = 0;
    writePtrTxCbuf = 0;
    rxWrapLimit = CIRC_BUFFER_RX_SIZE; // Restore default boundary
    ep1TxPendingLen = 0;
    ep1RxPendingIndex = 0;
    EndPoint[0].txCounter = 0;
    EndPoint[0].statusTx = EP_READY;
    EndPoint[0].totXferLen = 0;
    EndPoint[1].txCounter = 0;
    EndPoint[1].statusTx = EP_READY;
    EndPoint[1].totXferLen = 0;
//    EndPoint[2].txCounter = 0;
//    EndPoint[2].statusTx = EP_READY;
//    EndPoint[2].totXferLen = 0;

    // 3. Harware FIFO flush : Flush TX FIFO 0 (or whichever FIFO your IN endpoint uses)
    USB_OTG_HS->GRSTCTL = (1 << 5) | (16 << 6); // 0x20: TxFIFO Flush + all Tx FIFO
    while (USB_OTG_HS->GRSTCTL & (1 << 5));    // Wait for hardware to finish flushing

    // Flush ALL RX FIFOs
    USB_OTG_HS->GRSTCTL = (1 << 4);            // 0x10: RxFIFO Flush
    while (USB_OTG_HS->GRSTCTL & (1 << 4));    // Wait for hardware to finish flushing

    // 4. Clear stuck interrupts: Clear any pending transfer complete or error flags for EP1 (your CDC data EP)
    // Writing 1 to these bits usually clears them in CMSIS/Bare-metal
    USB_EP_OUT(1)->DOEPINT = 0xFF;
    USB_EP_IN(1)->DIEPINT  = 0xFF;
    //USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPINT  = 0xFF;

    // 5. RE-PRIME THE RECEIVE ENDPOINT (The "Unstick" Step)
    // If a big packet caused a NAK, try to start listening again for a fresh packet.
    // Use the same buffer-space check as the normal EP1 OUT path so a reset
    // can never arm DMA when the circular buffer cannot accept one full packet.
    USB_CDC_prepare_EP1_OUT_DMA();

    // 6. Synchronize our software flag with the fresh hardware state and atomic unlock
    EndPoint[1].statusTx = EP_READY;

    __enable_irq();
}


/**
* brief  Send Zero Length Packet
* In CDC (and most USB protocols), a ZLP is used to terminate a data transfer when the last payload sent was exactly the size of the Maximum Packet Size (MPS)
* param
* param
* retval OK/FAILED
*/
void send_zlp(uint8_t EPnum) {

    EndPoint[EPnum].statusTx = EP_ZLP;  // Update status so the ISR cleanup logic knows what to do next

    // Set Transfer Size: 1 packet, 0 bytes. We do this in one write to ensure hardware atomic-like update
    USB_EP_IN(EPnum)->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos) & USB_OTG_DIEPTSIZ_PKTCNT_Msk;
    __DMB(); // Ensure the register write is finished before enabling EP

    // Enable the endpoint and clear NAK to allow the Host to read the 0-byte packet
    USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

