Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
	if(EndPoint[1].statusRx == EP_BUSY) return EP_FAILED;


	USB_CDC_UserRxCallBack_EP1((uint16_t)param); // Weak function called upon interrupt XFRC (Transfer completed) - use then read_circBuffer() to process

	return param;
}

/***************************************************
*			USB enumeration
***************************************************/

void enumerate_Reset(){

	/************************************************************/
	/* 1. CLEAN THE PIPES FIRST                                 */
	/************************************************************/
	USB_FlushRxFifo(2000);       // Clear the Global Receive FIFO
	USB_FlushTxFifo(0, 2048);    // Clear Control EP0 TX FIFO
	USB_FlushTxFifo(1, 2048);    // Clear CDC Data EP1 TX FIFO

	/************************************************************/
	/* 2. RESET SOFTWARE STATE                                  */
	/************************************************************/
	set_device_status(DEVICE_STATE_RESET);
	USB_OTG_HS->GINTSTS = 0xFFFFFFFF; // Clear interrupts

	/************************************************************/
	/* 3. RECONFIGURE ENDPOINTS 							    */
	/************************************************************/


	USB_OTG_HS->GINTSTS = 0xFFFFFFFF; // reset OTG core interrupt register

	/* OTG all endpoints interrupt mask register */
	USB_OTG_DEVICE->DAINTMSK = 0x00030000U | (1U << 0) | (1U << 1); //| (1U << USB_CDC_NOTIFICATION_EP); // IEPINT-> IN EP0, EP1 & EP2 interrupts unmasked, OEPINT: OUT endpoint 0 & 1 interrupts unmasked
	USB_OTG_DEVICE->DOEPMSK  = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM; /* Unmask SETUP Phase done Mask,  TransfeR Completed interrupt for OUT */
	USB_OTG_DEVICE->DIEPMSK  = USB_OTG_DIEPMSK_XFRCM; /* TransfeR Completed interrupt for IN */

	USB_OTG_DEVICE->DCFG  &= ~USB_OTG_DCFG_DAD_Msk;  /* before Enumeration set address 0 */

	/* Endpoint 1 */
	USB_EP_IN(1)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
			USB_OTG_DIEPCTL_TXFNUM_0 |  /* TX Number 1 */
			USB_OTG_DIEPCTL_EPTYP_1 |  /* Eptype 10 means Bulk */
			USB_OTG_DIEPCTL_USBAEP |  /* Set Endpoint active */
			USB_CDC_MAX_PACKET_SIZE;  /* Max Packet size (bytes) */

	USB_EP_OUT(1)->DOEPTSIZ = 0;
	USB_EP_OUT(1)->DOEPCTL = USB_OTG_DOEPCTL_SNAK |
			USB_OTG_DOEPCTL_EPTYP_1 |
			USB_OTG_DOEPCTL_USBAEP |
			USB_CDC_MAX_PACKET_SIZE;

	initEndPoints(); /* Now that EP1 OUT is configured, let initEndPoints()
	 	 	 	 	  * program DMA and actually arm EP0/EP1. */

	/* EP2 is part of the CDC ACM descriptor even though the application does not
	 * currently send Serial-State notifications. Keep it NAKed until needed. */
//	USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
//			USB_OTG_DIEPCTL_TXFNUM_1 |
//			USB_OTG_DIEPCTL_EPTYP_0 |
//			USB_OTG_DIEPCTL_USBAEP |
//			USB_CDC_NOTIFICATION_MPS;
}


/**
 * brief  Handle all host requests, send all descriptors data
 * param
 * param
 * retval
 */
void enumerate_Setup(){
	// Combined request for your existing logic
	    uint16_t request = (setup_pkt_data.setup_pkt.bRequest << 8) | setup_pkt_data.setup_pkt.bmRequestType;
	    uint16_t len = setup_pkt_data.setup_pkt.wLength;
	    static uint8_t dest[128] __attribute__((aligned(4))); // Use static and keep the DMA source 4-byte aligned!

	switch(request){

	case REQ_TYPE_HOST_TO_DEVICE_GET_DEVICE_DECRIPTOR:
		switch(setup_pkt_data.setup_pkt.wValue){
		case DESCRIPTOR_TYPE_DEVICE: 				/* Request 0x0680  Value 0x0100 */
			if(DEVICE_DESCRIPTOR_LENGTH < len) len = DEVICE_DESCRIPTOR_LENGTH;
			memcpy(dest, deviceDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_CONFIGURATION: 			/* Request 0x0680  Value 0x0200 */
			if(CONFIGURATION_DESCRIPTOR_LENGTH < len) len = CONFIGURATION_DESCRIPTOR_LENGTH;
			memcpy(dest, configurationDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_DEVICE_QUALIFIER: 			/* Request 0x0680  Value 0x0600 */
			if(DEVICE_QUALIFIER_LENGTH < len) len = DEVICE_QUALIFIER_LENGTH;
			memcpy(dest, deviceQualifierDescriptor, len);
			//	return; /* CUBE MX CDC actually doesn't send any data here */
			break;
		case DESCRIPTOR_TYPE_OTHER_SPEED_CONFIGURATION: 	/* Request 0x0680  Value 0x0700 */
			// Returns the configuration structure that would apply if connected at FS (64-byte Bulk packets instead of 512)
		    if(CONFIGURATION_DESCRIPTOR_LENGTH < len) len = CONFIGURATION_DESCRIPTOR_LENGTH;
		    memcpy(dest, otherSpeedConfigurationDescriptor, len);
		    break;
		case DESCRIPTOR_TYPE_LANG_STRING: 			/* Request 0x0680  Value 0x0300 */
			if(LANG_DESCRIPTOR_LENGTH < len) len = LANG_DESCRIPTOR_LENGTH;
			memcpy(dest, languageStringDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_MFC_STRING: 			/* Request 0x0680  Value 0x0301 */
			if(MFC_DESCRIPTOR_LENGTH < len) len = MFC_DESCRIPTOR_LENGTH;
			memcpy(dest, manufactorStringDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_PROD_STRING: 			/* Request 0x0680  Value 0x0302 */
			if(PRODUCT_DESCRIPTOR_LENGTH < len) len = PRODUCT_DESCRIPTOR_LENGTH;
			memcpy(dest, productStringDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_SERIAL_STRING: 			/* Request 0x0680  Value 0x0303 */
			/* Either the default STM32 UID or the application-defined serial. */
			if (serialNumberStringDescriptor[0] < len)
				len = serialNumberStringDescriptor[0];
			memcpy(dest, serialNumberStringDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_CONFIGURATION_STRING: 		/* Request 0x0680  Value 0x0304 */
			if(CONFIG_STRING_LENGTH < len) len = CONFIG_STRING_LENGTH;
			memcpy(dest, configurationStringDescriptor, len);
			break;
		case DESCRIPTOR_TYPE_INTERFACE_STRING: 			/* Request 0x0680  Value 0x0305 */
			if(INTERFACE_STRING_LENGTH < len) len = INTERFACE_STRING_LENGTH;
			memcpy(dest, stringInterface, len);
			break;
		default:
			return;
		}
		break;

	case REQ_TYPE_DEVICE_TO_HOST_SET_ADDRESS: 				/* Request 0x0500  */
		len=0; /* ZLP */
		USB_OTG_DEVICE->DCFG &= ~((uint32_t)0x7F << 4); // Clear the 7-bit DAD field (bits 4 to 10) first!
		USB_OTG_DEVICE->DCFG |= (uint32_t)(setup_pkt_data.setup_pkt.wValue << 4);
		device_state = DEVICE_STATE_ADDRESSED;
		break;
	case REQ_TYPE_DEVICE_TO_HOST_SET_CONFIGURATION: 			/* Request 0x0900  */
		len=0; /* ZLP */
		//USB_CDC_ForceResetState(); // When the PC assigns an address or sets the configuration, it will start a fresh session with this hardware
		device_state = DEVICE_STATE_CONFIGURED;
		break;

	case CDC_GET_LINE_CODING: 						/* Request 0x21A1  */
		if(CDC_LINE_CODING_LENGTH < len) len = CDC_LINE_CODING_LENGTH;
		memcpy(dest, lineCoding, len);
		set_device_status(DEVICE_STATE_LINECODED);
		break;
	case CDC_SET_LINE_CODING:
		/* Host will send 7 bytes in the OUT data stage. Do NOT send the status ZLP yet.
		 * The EP0 OUT XFRC interrupt will call USB_CDC_transferRXCallback_EP0() after the
	     * 7 bytes have actually arrived.   */
	    return;
	case CDC_SET_CONTROL_LINE_STATE: /* Request 0x2221 - when click "Connect" in TeraTerm, the PC sends this request (Data Terminal Ready signal) */
		len=0;
		// USB_CDC_ForceResetState(); // Ensures that if there is no "garbage" left in the circular buffer from a previous session
		break;
	case CLEAR_FEATURE_ENDP: 						/* Request 0x0201  */
		uint8_t ep_num = setup_pkt_data.setup_pkt.wIndex & 0x7F;
		uint8_t is_in = setup_pkt_data.setup_pkt.wIndex & 0x80;
		if (is_in) {
			// 1. Clear the STALL bit in DIEPCTL
			USB_EP_IN(ep_num)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
			// 2. Reset Data Toggle to DATA0
			USB_EP_IN(ep_num)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
		} else {
			// 1. Clear the STALL bit in DOEPCTL
			USB_EP_OUT(ep_num)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
			// 2. Reset Data Toggle to DATA0
			USB_EP_OUT(ep_num)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
		}
		len = 0; // Prepare ZLP for Status Phase
		break;   // Fall through to EndPoint[0].setTxBuffer
	default:
		// For unsupported control requests, stall EP0 IN and OUT
		// The USB spec dictates that the hw automatically clears the STALL condition on EP0 when a new Setup packet is received
		// When the host sees that an EP has been stalled, it will issue the standard control request CLEAR_FEATURE (specifically ENDPOINT_HALT)
		USB_EP_IN(0)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
		USB_EP_OUT(0)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
		break;
	}

