Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
        /* Release the RX data only after memcpy() has finished. This is what prevents a newly armed
         * USB DMA transfer from overwriting the block while the application is copying it. */
        commit_circBufferRx(data.len);

        total += data.len;
    }

    return total;
}

/*********************************************************************************/
/**************************** OTG FS ISR *****************************************/
/*********************************************************************************/

extern void OTG_HS_IRQHandler(void);

void OTG_HS_IRQHandler(){

/*	Typically handle the ISR these in order:
	-ENUMDNE (Enumeration Done): The hardware tells you the speed is set.
	-RXFLVL (RX FIFO Non-Empty): There is a packet from the PC. You read it to see if it's a SETUP, OUT, or DATA packet.
	-IEPINT (In Endpoint Interrupt): A previous "Send" (In) operation finished successfully; you can now send more data. */

	// Identify only the interrupts that are both PENDING and ENABLED
	uint32_t active_irq = USB_OTG_HS->GINTSTS & USB_OTG_HS->GINTMSK; /* MODIFIED FOR HS */

	/* SUSPEND DETECTED - to use uncomment in USB_OTG_HS_init_registers()
		 If USB bus has gone quiet (which happens about 3ms after you unplug the cable or the PC goes to sleep) */
	if (active_irq & USB_OTG_GINTSTS_USBSUSP){
		USB_OTG_HS->GINTSTS = USB_OTG_GINTSTS_USBSUSP; // clear flag /* MODIFIED FOR HS */
		USB_CDC_ForceResetState(); // Perform the robust cleanup
	}

	/* Wakeup DETECTED - to use uncomment in USB_OTG_HS_init_registers() */
	if (active_irq & USB_OTG_GINTSTS_WKUINT){
		USB_OTG_HS->GINTSTS = USB_OTG_GINTSTS_WKUINT; // clear flag /* MODIFIED FOR HS */
		USB_CDC_ForceResetState();
	}

	/**************************************************************/
	/****************** USBRST Reset event ************************/
	/**************************************************************/
	// The core sets this bit to indicate that a reset is detected on the USB.
	if(active_irq & USB_OTG_GINTSTS_USBRST){
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_USBRST);
		enumerate_Reset();
		return;
	}

	/**************************************************************/
	/****************** ENUMDNEM event ****************************/
	/**************************************************************/
	/* The core sets this bit to indicate that speed enumeration is complete: the hardware-level connection and speed negotiation (reset/chirp) are complete,
		   allowing software to begin handling USB control transfers (such as address assignment and descriptor setup).
		   The application must read the OTG_DSTS register to obtain the enumerated speed.
	 */
	if(active_irq & USB_OTG_GINTSTS_ENUMDNE){
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_ENUMDNE);
		set_device_status(DEVICE_STATE_DEFAULT);
	}

	/**************************************************************/
	/*************** IN endpoint event ****************************/
	/**************************************************************/

	/* IN endpoint event */
	if(USB_OTG_HS->GINTSTS & USB_OTG_GINTSTS_IEPINT){ /* MODIFIED FOR HS */

		uint32_t epnums = USB_OTG_DEVICE->DAINT;

		// --- Check EP0 IN ---
		if (epnums & (1U << USB_CDC_CONTROL_EP)) {
			uint32_t IN_interrupt = USB_EP_IN(0)->DIEPINT;

			if (IN_interrupt & USB_OTG_DIEPINT_XFRC) {
				// CRITICAL: Handshake for Control Status Phase -  Prepare for the next Setup Packet
				USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
				EndPoint[0].txCounter = 0; // crucial to restart USB_CDC_setTxBuffer()
				EndPoint[0].statusTx = EP_READY;
				clear_USB_device_status(DEVICE_STATE_TX_PR);
				USB_EP_IN(0)->DIEPINT = USB_OTG_DIEPINT_XFRC;
			}
			CLEAR_IN_EP_INTERRUPT(0, IN_interrupt);
		}

		// --- Check EP1 IN ---
		if (epnums & (1U << USB_CDC_DATA_IN_EP)) {
			uint32_t IN_interrupt = USB_EP_IN(1)->DIEPINT;

			if (IN_interrupt & USB_OTG_DIEPINT_XFRC) {
				CLEAR_IN_EP_INTERRUPT(1, USB_OTG_DIEPINT_XFRC);

				// 1. Handle ZLP Logic First
				if (EndPoint[1].statusTx == EP_BUSY) {
					if (EndPoint[1].totXferLen > 0 && (EndPoint[1].totXferLen % MAX_CDC_EP1_TX_SIZ == 0)) { /* MODIFIED FOR HS: 512 bytes instead of 64 */
						send_zlp(1);
						return; // Exit ISR, wait for ZLP's XFRC
					}
				}

				// 2. The transfer is officially DONE
				/*
				 * Commit the circular-buffer data only now, after USB DMA
				 * has reported XFRC. For a packet-size-multiple transfer,
				 * this also happens after the terminating ZLP.
				 */
				commit_circBufferTx(ep1TxPendingLen);
				ep1TxPendingLen = 0;

				EndPoint[1].txCounter = 0;
				EndPoint[1].statusTx = EP_READY;
				clear_USB_device_status(DEVICE_STATE_TX_PR);

				// 3. Re-prime the OUT endpoint only if the RX circular buffer
				// has room for a complete HS packet. If not, leave it NAKed;
				// the application will re-arm it when it consumes RX data.
				USB_CDC_prepare_EP1_OUT_DMA();

				// 4. Trigger next transfer IF there is data in the buffer
				if (is_circBufferTx_empty() == 0) {
					USB_CDC_transmit_scheduler();
			        } else {
			            // Only SNAK if the buffer is truly empty and we aren't about to send more
			            USB_EP_IN(1)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
			        }
		    }

		    // Safety: Clear any other pending bits for this EP
		    USB_EP_IN(1)->DIEPINT = IN_interrupt;
		    }

		// --- Check EP2 IN (CDC notification endpoint) ---
//		if (epnums & (1U << USB_CDC_NOTIFICATION_EP)) {
//			uint32_t IN_interrupt = USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPINT;
//			if (IN_interrupt & USB_OTG_DIEPINT_XFRC) {
//				/* No Serial-State notification producer is implemented yet.
//				 * EP2 remains NAKed after any completed notification transfer. */
//				USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
//			}
//			USB_EP_IN(USB_CDC_NOTIFICATION_EP)->DIEPINT = IN_interrupt;
//		}
	}
	// DO NOT call USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT) here! It is a read-only logical OR of the individual endpoint interrupts.
	// If you manually write to GINTSTS to clear IEPINT, you might accidentally clear EP1's "Global" flag before you've had a chance to see EP1's flag.
	//USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT);

	/***************************************************************/
	/*************** OUT endpoint event - OEPINT ********************
	 ***************************************************************		*/

	if(USB_OTG_HS->GINTSTS & USB_OTG_GINTSTS_OEPINT){ /* OUT endpoint event */

