Nicolas7474/STM32F446_USB_CDC_HS_Driver_Bare-Metal/Sources/usb_cdc_hs.c
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_OEPINT);
		uint32_t epnums  = USB_OTG_DEVICE->DAINT;    /* Read out EndPoint INTerrupt bits */

		/************************	 EP 0  	OUT	  *******************************/
		if( epnums & 0x00010000){ /* EndPoint INTerrupt bits correspond to EP0 OUT */
			uint32_t epint = USB_EP_OUT(0)->DOEPINT; /* Read out Endpoint Interrupt register for EP0 */

			if(epint & USB_OTG_DOEPINT_STUP){		/*  SETUP phase done, Setup packet received */
				/* The SETUP packet was received by EP0 DMA into rxBufferEp0. */
				memcpy(setup_pkt_data.raw_data, rxBufferEp0, sizeof(setup_pkt_data.raw_data));
				enumerate_Setup();
			}
			if(epint & USB_OTG_DOEPINT_XFRC){

				/* EP0 OUT DMA completed. Capture the actual data-stage length. */
				uint16_t remaining = (uint16_t)(USB_EP_OUT(0)->DOEPTSIZ & USB_OTG_DOEPTSIZ_XFRSIZ);
				uint16_t len = (uint16_t)(RX_BUFFER_EP0_SIZE - remaining);
				EndPoint[0].rxCounter = len;

				/* SET_LINE_CODING has an OUT data stage. Process it only after DMA XFRC. */
				uint16_t request = ((uint16_t)setup_pkt_data.setup_pkt.bRequest << 8) |
						setup_pkt_data.setup_pkt.bmRequestType;

				ITM_SendChar('R');
				ITM_PrintHex32(request);
				ITM_SendChar(' ');
				ITM_PrintHex32(len);
				ITM_SendChar('\r');
				ITM_SendChar('\n');


				if ((request == CDC_SET_LINE_CODING) && (len > 0))
					EndPoint[0].rxCallBack(CDC_SET_LINE_CODING);


				/* Re-arm EP0 OUT for DMA reception, preserving the Setup Count so the hardware can continue to intercept incoming USB setup commands. */
				uint32_t ep0_pktcnt = (RX_BUFFER_EP0_SIZE + MAX_CDC_EP0_TX_SIZ - 1) / MAX_CDC_EP0_TX_SIZ;
				USB_EP_OUT(0)->DOEPTSIZ = (ep0_pktcnt << 19)	| RX_BUFFER_EP0_SIZE
																| USB_OTG_DOEPTSIZ_STUPCNT;

				// Point DMA engine back to the start of the control buffer destination
				USB_EP_OUT(0)->DOEPDMA = (uint32_t)(rxBufferEp0);

				if ((request == CDC_SET_CONTROL_LINE_STATE) || (request == CDC_GET_LINE_CODING)/* || (request == CDC_SET_LINE_CODING)*/) {
					// Crucial: Wait until EPENA == 0 to set again CNAK & EPENA to avoid Incomplete error on the next packet (Line Coding)
					uint32_t timeout = 100000;
					while ((USB_EP_OUT(0)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) && timeout--); // Wait 72ns (13 cycles measured)
					if (timeout == 0) {
						 USB_CDC_ForceResetState();    // EP0 failed to become idle
						 return;
					}
				}
				// CNAK and EPENA must be set again to activate hardware reception via DMA
				USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
			}
			CLEAR_OUT_EP_INTERRUPT(0, epint);
		}

		/* Originally used the TXEF interrupt (that triggers whenever the FIFO is empty) and used USB_OTG_DIEPINT_XFRC interrupt only
		  for the last packet but it was required a blocking while(); to wait EPENA to deactivate from the previous transfer -> switched to all XFRC interrupts */

		/************************	 EP 1  	OUT	  *******************************/
		if( epnums & 0x00020000){ /* EndPoint INTerrupt bits correspond to EP1 OUT */

			// OTG_DOEPINTx : this register indicates the status of an endpoint with respect to USB- and AHB-related events.
			uint32_t epint = USB_EP_OUT(1)->DOEPINT; /* Read out Endpoint Interrupt register for EP1 */

			// XFRC: Transfer completed interrupt. Indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
			if(epint & USB_OTG_DOEPINT_XFRC){

				uint16_t remaining =
					USB_EP_OUT(1)->DOEPTSIZ & USB_OTG_DOEPTSIZ_XFRSIZ;

				uint16_t len = RX_BUFFER_EP1_SIZE - remaining;

				/*
				 * USB DMA wrote to the staging buffer. Now that XFRC has
				 * confirmed completion, commit the received bytes to the
				 * circular buffer and advance its write pointer.
				 */
				if (len > 0) {
					memcpy(&circBufferRx[ep1RxPendingIndex],
					       ep1RxDmaBuffer,
					       len);

					writePtrRxCbuf = (uint16_t)(ep1RxPendingIndex + len);
					if (writePtrRxCbuf >= CIRC_BUFFER_RX_SIZE)
						writePtrRxCbuf = 0;

					ep1RxPendingIndex = writePtrRxCbuf;

					EndPoint[1].rxCallBack(len); // EndPoint[i].rxCallBack = &USB_CDC_transferRXCallback_EP1
				}

				// Re-arm EP1 OUT for the next DMA reception.
				USB_CDC_prepare_EP1_OUT_DMA();
			}
			CLEAR_OUT_EP_INTERRUPT(1, epint);
		}
		return;
	}
}
